module.exports = {
  message: {
    language: '中文',
    register: ['登录', '注册', '注销'],
    nav_title: [
      '主页新闻', '矿池统计', '帮助中心', '我的账户'
    ],
    nav_homepage: [
      '主页', '新闻', '组', '博客'
    ],
    min_sta: [
      '系統统计', 'Hash速率证明', '矿区历史', '名人堂', 'JSON統计'
    ],
    help_center: [
      '帮助中心', '开发角', '服务条款'
    ],
    account: [
      '仪表盘', '矿工', '监控', '报酬', '报酬支付历史', '活动日志', '设置','入门'
    ],
    bitcoin_btn: '设置比特币矿池',
    zcash_btn: '设置零钞矿池'
  },
  introduce: {
    title: ['传统 & 信任', '活跃的 开发', '独特的投票系统', '高 可用性', '账户 安全', '专业的 技术支持'],
    one: [
      '世界上第一个比特币矿池',
      '自2017年12月开始运作',
      '自2010年12月起有超过1,000,000比特币已被挖',
      '长期稳定和准确的报酬支付历史'
    ],
    two: [
      '新特性已添加。请从发布说明获取更多信息。',
      '由您的hash 速率驱动的开发提议',
      '提交您对矿池改进的建议并让大家参与投票'
    ],
    three: '我们的游泳池在政治上保持中立。因此，我们的投票制度给每一个矿工都发出了声音。简单地将您的散列率引导到您最喜欢的协议提议中。',
    four: '我们的服务器分布全球。 智能的负载平衡 和 故障转移系统 确保您在99.9%的时间挖矿进行中。',
    five: "整个基础设施运行在 高度安全的服务器 上。 您的钱包可以由 双重认证 (2FA) 保护。",
    six: '我们的技术支持小组在这里 全年每天24小时 为您服务。我们为给您在任何情况下提供有用的答复正非常努力地工作着。'
  },
  account: {
    title: ['请登录', '注册账户','重设密码'],
    lghint: ['请输入邮箱地址或手机号码', '请输入密码', '请输入邮箱地址', '请再次输入密码'],
    btn: ['登录', '注册账户', '忘记密码', '现在注册', '我同意', '服务条款','重置我的密码']
  },
  footer: ['从', '和', '关注我们。', '比特币价格由', '提供'],
  myaccount: {
    title: '账户',
    setmail: {
      title: '更改信息',
      change:['如果您要修改信息请先输入密码','要更改您的邮箱地址，请输入新邮箱并到您的旧邮箱里找到确认链接点击进去。'],
      mail:['当前邮箱','新邮箱'],
    },
    setpwd:{
      title:'更改密码',
      pwd:['当前密码','新密码','再次输入密码']
    },
    telphone:{
      title:'更换手机',
      telbox:'手机号'
    },
    btn:['重置','提交']
  },
  mobileDialog:{
    title:["国际代码","手机号","验证码"],
    btn:["获取验证码","重新获取","提交","取消",'修改','绑定'],
    placeholder:['请输入手机','请输入验证码','请选择']
  },
  register:["请输入正确的邮箱地址","请输入正确的密码(8-24位长度字元，支持大写英文、小写英文、数字、半形标点，並包含至少三种)","输入的密码与上次输入的不符合","注冊成功","邮箱已存在","请同意服务条款",'请输入正确的手机号'],
  loginMessage:["登录成功","请输入正确的账号信息","请输入账号信息",'登录失败'],
  el_message:["请输入正确手机号","请选择国际代码","获取验证码","请输入手机号","请输入验证码","请输入国际代码","请重新输入",'重新获取验证码'],
  pwdVerify:["请输入密码","提示","确定","取消","请先登录或者注册账户"],
  success:['修改成功','绑定成功','成功','失败','以发送确认邮件到您的邮箱,请到邮箱中确认...'],
  resetPwd:{
    title:["输入新密码","请输入新密码两次以供我们验证您输入正确"],
    placeholder:['新密码','再次输入密码'],
    value:'更改我的密码'
  },
  aside:['仪表盘','账户','入门','矿工','监控','报酬','报酬支付历史','活动日志'],
  poolServer:{
    title:['入门指南','服务器选项','开始挖掘','设置您的报酬支付地址'],
    conLeft:['链接：','用户ID：','密码：'],
    conRight:['用户名.','矿工名','任意'],
    conP:['您可以从官方硬币公布页面获得适当的矿工计划。','您可以在上购买散列功能，以便在没有矿工的情况下开采硬币，没有任何按现收现付的合同。','为了收集您的报酬您需要设置一个支付地址。如果您没有任何地址，请去弄一个比特币钱包：']
  },
  pools:['货币名字','算法','费用','矿工数量','矿池算力','效率','营收','掘矿难度','上次开矿时间'],
  card:{
    myWorking:['个人挖掘资料','我的哈希率','算力','矿工数量','最后提交股份的时间','新一轮股票','新一轮的贡献','总股份','区块数量'],
    poolWork:['矿池挖掘资料','网络的哈希率','区块数量','区块难度','算力','矿工数量','最后提交股份的时间','最后挖掘的区块','进度','总股份','区块数量'],
    Network:['货币区块链资料','网络哈希率','算法','区块生成时间','最后区块ID','区块奖励','难度','软件版本'],
    coin:['货币资料','DigiByte','网页','价格','市场价值'],
    luckly:['最近开矿','最新开矿','开矿时间','区块状态/区块高度','开发者','实际','幸运值'],
    unconfirmed:['我的未确认收入','最新收入'],
    balance:['我的余额','最新交易'],
    effective:['我的有效工人','我的工人资料','活跃的工人']
  },
  breadcrumb:['首页','系统统计'],
  loginHint:['部分资料需要登录才能够显示'],
  resetPwdMess:['修改成功']
}
