module.exports = {
  message: {
    language: '繁體',
    register: ['登錄', '注冊', '注銷'],
    nav_title: [
      '主頁新聞', '礦池統計', '幫助中心', '我的賬戶'
    ],
    nav_homepage: [
      '主頁', '新聞', '組', '博客'
    ],
    min_sta: [
      '系統統計', 'Hash速率證明', '礦區歷史', '名人堂', 'JSON統計'
    ],
    help_center: [
      '幫助中心', '開發角', '服務條款'
    ],
    account: [
      '儀表槃', '礦工', '監控', '報酬', '報酬支付歷史', '活動日志', '設置','入門'
    ],
    bitcoin_btn: '設置比特幣礦池',
    zcash_btn: '設置零鈔礦池'

  },
  introduce: {
    title: ['傳統&信任', '活躍的開發', '独特的投票系统', '高 可用性', '帳戶安全', '專業的技術支援'],
    one: [
      '世界上第一個比特幣礦池',
      '自2017年12月開始運作',
      '自2017年12月起有超過1000000比特幣已被挖',
      '長期穩定和準確的報酬支付歷史'
    ],
    two: [
      '新特性已添加。請從發佈說明獲取更多資訊。',
      '由您的hash速率驅動的開發提議',
      '提交您對礦池改進的建議並讓大家參與投票'
    ],
    three: '我們的游泳池在政治上保持中立。囙此，我們的投票制度給每一個礦工都發出了聲音。簡單地將您的散列率引導到您最喜歡的協定提議中。',
    four: '我們的服務器分佈全球。智慧的負載平衡和故障轉移系統確保您在99.9%的時間挖礦進行中。',
    five: "整個基礎設施運行在高度安全的服務器上。您的錢包可以由雙重認證（2FA）保護。",
    six: '我們的技術支援小組在這裡全年每天24小時為您服務。我們為給您在任何情况下提供有用的答覆正非常努力地工作著。'

  },
  account: {
    title: ['請登錄', '注冊賬戶','重設密碼'],
    lghint: ['請輸入郵箱地址或手機號', '請輸入密碼', '請輸入郵箱', '請再次輸入密碼'],
    btn: ['登錄', '注冊賬戶', '忘記密碼', '現在注冊', '我同意', '服務條款', '重置我的密碼']
  },
  footer: ['從', '和', '關注我們。', '比特幣價格由', '提供'],
  myaccount: {
    title: '帳戶',
    setmail: {
      title: '更改信息',
      change: ['如果您要修改信息請先輸入密碼', '要更改您的郵箱地址，請輸入新郵箱並到您的舊郵箱裏找到確認連結點擊進去。'],
      mail: ['當前郵箱', '新郵箱'],
    },
    setpwd: {
      title: '更改密碼',
      pwd: ['當前密碼', '新密碼', '再次輸入密碼']
    },
    telphone: {
      title: '更換手機',
      telbox: '手機號'
    },
    btn: ['重置', '提交']
  },
  mobileDialog: {
    title: ["國際代碼", "手機號", "驗證碼"],
    btn: ["獲取驗證碼", "重新獲取", "提交", "取消", "修改"],
    placeholder: ['請輸入手機', '請輸入驗證碼', '請選擇']
  },
  register:["請輸入正確的郵箱地址","請輸入正確的密碼(8-24位長度字元，支援大寫英文、小寫英文、數字、半形標點，並包含至少三種)","輸入的密碼與上次輸入的不符合","注冊成功","郵箱已存在","請同意服務條款",'請輸入正確的手機號'],
  loginMessage: ["登錄成功", "請輸入正確的賬戶信息", "請輸入賬戶信息",'登錄失敗'],
  el_message: ["請輸入正確的手機號","請選擇國際代碼", "獲取驗證碼", "請輸入手機號", "請輸入驗證碼", "請輸入國際代碼", "請重新輸入",'重新獲取驗證碼'],
  pwdVerify:["請輸入密碼","提示","確定","取消","請先登錄或者注册帳戶"],
  success:['修改成功','綁定成功','成功','失敗','以發送確認郵件到您的郵箱,請到郵箱中確認...'],
  resetPwd:{
    title:["輸入新密碼","請輸入新密碼兩次以供我們驗證您輸入正確"],
    placeholder:['新密碼','再次輸入密碼'],
    value:'更改我的密碼'
  },
  aside:['儀表槃','賬戶','入門','礦工','監控','報酬','報酬支付歷史','活動日志'],
  poolServer:{
    title:['入門指南','服務器選項','開始挖掘','設定您的報酬支付地址'],
    conLeft:['連結：','用戶ID：','密碼：'],
    conRight:['用戶名.','礦工名','任意'],
    conP:['您可以從官方硬幣公佈頁面獲得適當的礦工計畫。','您可以在上購買散列功能，以便在沒有礦工的情况下開採硬幣，沒有任何按現收現付的契约。','為了收集您的報酬您需要設定一個支付地址。如果您沒有任何地址，請去弄一個比特幣錢包：']
  },
  pools:['貨幣名字','算法','費用','礦工數量','礦池算力','效率','營收','掘礦進度','上次開礦時間'],
  card:{
    myWorking:['個人挖掘資料','我的雜湊率','算力','礦工數量','最后提交股份的时间','新一輪股票','新一輪的貢獻','總股份','區塊數量'],
    poolWork:['礦池挖掘資料','网络的哈希率','區塊數量','區塊難度','算力','礦工數量','最後提交股份的時間','最後挖掘的區塊','進度','總股份','區塊數量'],
    Network:['貨幣區塊鏈資料','網絡雜湊率','算灋','區塊生成時間','最後區塊ID','區塊獎勵','難度','軟體版本'],
    coin:['貨幣資料','DigiByte','網頁','價格','市場價值'],
    luckly:['最近開礦','最新開礦','開礦時間','區塊狀態/區塊高度','開發者','實際','幸運值'],
    unconfirmed:['我的未確認收入','最新收入'],
    balance:['我的餘額','最新交易'],
    effective:['我的有效工人','我的工人資料','活跃的工人']
  },
  breadcrumb:['首頁','系統統計'],
  loginHint:['部分資料需要登錄后才能顯示'],
  resetPwdMess:['修改成功']
}
